blog-posts/2004-11-20-emacs-wiki-snippet-for-getting-a-list-of-images-from-a-dired-buffer.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>emacs-wiki snippet for getting a list of images from a dired buffer</title>
<!-- 2014-04-30 Wed 17:00 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">emacs-wiki snippet for getting a list of images from a dired buffer</h1>
<p>
November 20th, 2004 -
<a href="http://sachachua.com/blog/p/2418"><a href="http://sachachua.com/blog/p/2418">http://sachachua.com/blog/p/2418</a></a>
</p>

<pre class="example">
(defun sacha/emacs-wiki-marked-images-as-kill ()
  "Return a list of images ready to be inserted into a wiki page."
  (interactive)
  (kill-new (mapconcat
             'emacs-wiki-make-link
             (dired-get-marked-files)
             "\n")))
</pre>

<p>
bash script for timestamping and thumbnailing pictures
</p>

<pre class="example">
#!/bin/bash
SIZE=320x240
while [ -n "$1" ]; do
  if [ -f $1 ]; then
    DATE=$(date +"%Y%m%d-%H%M%S" --reference="$1")
    EXT=$(echo "$1" | sed 's/.*\././')
    echo $1
    cp $1 "$DATE$EXT"
    cp "$DATE$EXT" "thumb-$DATE$EXT"
    touch --reference="$1" "$DATE$EXT"
    if [ "$EXT" == ".jpg" ]; then
       convert -size $SIZE -resize $SIZE "$DATE$EXT" "thumb-$DATE$EXT"
       touch --reference="$1" "thumb-$DATE$EXT"
    fi
  fi
  shift
done
</pre>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
